{"schedule": {"version": "1.2", "base_url": "https://pretalx.evolutio.pt/pyconpt2022/schedule/", "conference": {"acronym": "pyconpt2022", "title": "PyCon Portugal 2022", "start": "2022-09-24", "end": "2022-09-24", "daysCount": 1, "timeslot_duration": "00:05", "time_zone_name": "Europe/Lisbon", "rooms": [{"name": "Auditorium", "guid": null, "description": null, "capacity": 200}, {"name": "Workshops", "guid": null, "description": null, "capacity": 150}], "days": [{"index": 1, "date": "2022-09-24", "day_start": "2022-09-24T04:00:00+01:00", "day_end": "2022-09-25T03:59:00+01:00", "rooms": {"Auditorium": [{"id": 407, "guid": "ae16f93d-91a8-5ae7-924e-c15be6f657f6", "logo": "", "date": "2022-09-24T09:00:00+01:00", "start": "09:00", "duration": "00:15", "room": "Auditorium", "slug": "pyconpt2022-407-opening-session", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/WEVRTF/", "title": "Opening Session", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Opening Session", "description": "Video: https://youtu.be/D6sdCD5FhDs", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}, {"id": 405, "guid": "d7430ba3-71c0-55ce-9f3f-17a3b8e261f2", "logo": "", "date": "2022-09-24T09:15:00+01:00", "start": "09:15", "duration": "01:00", "room": "Auditorium", "slug": "pyconpt2022-405-keynote-what-am-i-doing-", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/PQSJBK/", "title": "KEYNOTE: What am I doing?", "subtitle": "", "track": null, "type": "Keynote", "language": "en", "abstract": "As a programmer, I often ask myself: what am I doing?!", "description": "That’s a question and an experience shared by other professionals whose craft is also sometimes difficult and technically puzzling - for example, chefs or opera singers.\r\n\r\nBut while chefs rarely ask “what is cooking?”, and opera singers rarely ask “what is singing?”, programmers are forever raising the question: “what is programming?”\r\n\r\nWhat am doing, as a programmer? What is the nature of my craft?\r\n\r\nVideo: https://youtu.be/gjutf_Af9HQ", "recording_license": "", "do_not_record": false, "persons": [{"id": 224, "code": "FDRCZ3", "public_name": "Daniele Procida", "biography": "I'm a Director of Engineering at Canonical, where I am working to transform documentation practice across 40-plus engineering teams. I love Django, DjangoCons and documentation (I am the author of the [Diátaxis documentation framework](https://diataxis.fr/).\r\n\r\nI think it would be better to humanise software than softwarise humans.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 365, "guid": "98290681-b6bc-53a9-aad5-a20319d01753", "logo": "", "date": "2022-09-24T10:45:00+01:00", "start": "10:45", "duration": "00:35", "room": "Auditorium", "slug": "pyconpt2022-365-a-python-based-methodology-for-solving-sustainability-problems-with-data-science", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/H8ZHTY/", "title": "A Python-Based Methodology for Solving Sustainability Problems with Data Science", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Python, as a one-stop-shop for Machine Learning, Geospatial Analytics, Optimization Algorithms, and Visualization Tools, can be leveraged to create a simple yet effective sustainability decision-making methodology with just four steps: Geospatial Indexing, Feature Engineering, Predictive Scoring, and Score Optimization.\r\n\r\nWith it, it's possible to tackle distinct sustainable development issues, from mobility transition to light pollution in a way that decision-makers can quickly implement it to take action for the Sustainable Development Goals.", "description": "How can we solve sustainability problems through data?\r\n\r\nAI, Data Science, and Analytics brought immense advantages to many businesses. However, there seems to be a gap concerning sustainability, in which decision-making is not yet benefitting as much as it could from these technologies.\r\n\r\nThis talk takes a deep dive into this topic and how Python can help us bridge the gap by being a one-stop shop for all kinds of tools required to approach these problems. We propose a simple 4-step data science methodology: Geospatial Indexing, Feature Engineering, Predictive Scoring, and Score Optimization.\r\n\r\nWe will dive into the specificities of each one of these steps and go through their requirements, dependencies and applications. Afterward, we will move to the deployment of solutions and how they translate into tangible impact on several issues with four case studies. \r\n\r\nThis methodology has been successfully used in different Data Science competitions, including the winning solution for the World Data League, which gathers the best data scientists to solve social impact challenges.", "recording_license": "", "do_not_record": false, "persons": [{"id": 392, "code": "SKPX9U", "public_name": "Diogo Valente Polónia", "biography": "22-year-old Portuguese student, finishing my Master's in Industrial Engineering and Management at the University of Porto. With extensive experience in business, strategy, and engineering case study competitions, as well as in data science hackathons, both nationally and internationally. \r\nI've been active in several juvenile associations, most prominently, as President of ShARE-UP, a junior association that develops a training program for students and consulting projects for startups and businesses, focusing on combining economic performance with societal progress.\r\nProfessionally, I've worked at Smartex.ai, a fast-growing Portuguese start-up that is disrupting the textile industry by providing AI tools to minimize waste production, and its environmental consequences. Besides, I've used analytical and machine learning tools in a brief internship at Sonae Fashion, as part of the Customer Strategy team.\r\nCurrently looking for ways to apply business, analytical and technical concepts to solve social or environmental issues.", "answers": []}, {"id": 393, "code": "UJJVEK", "public_name": "João Afonso Pereira", "biography": "Biomedical Engineer working as Data Scientist in a fast-growing med-tech startup. My professional career started in 2017, first collaborating on several research projects and then moving to a multinational IoT company before changing to my current position. My goal is to deliver real impact through analytics, AI and communication, always focused on sustainable development.", "answers": []}, {"id": 418, "code": "F8D3ET", "public_name": "Patrícia Rocha", "biography": "MSc in Bioengineering with a specialization in Biomedical Engineering. Currently working as a Data Scientist at Automaise, developing AI-powered solutions to improve customer care.", "answers": []}, {"id": 419, "code": "3RHQDG", "public_name": "João Matos", "biography": "Portuguese, 22, and master’s student of Biomedical Engineering at the University of Porto. My name is João Matos and I am passionate about traveling, having lived in 4 different countries. I am currently living in Japan and I will move to the US in October to develop my master’s thesis at MIT. As a Biomedical Engineering to-be, I want to bring AI and clinical data together to improve healthcare and people’s quality of life. Driven by delivering a good impact with my analytical and technical skills, I am also interested in solving sustainability and societal issues. I was President of ShARE-UP, a Do Well Do Good international consulting club that promotes social progress. More recently, alongside my teammates, I won a couple of datathons with challenges that tackled some of the United Nations’ Sustainable Development Goals.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 357, "guid": "a30fdf58-6e58-53de-a6af-7dac85217f36", "logo": "", "date": "2022-09-24T11:20:00+01:00", "start": "11:20", "duration": "00:35", "room": "Auditorium", "slug": "pyconpt2022-357-how-to-become-a-fastapi-expert", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/ETRAXR/", "title": "How to become a FastAPI Expert", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "The secret of becoming a FastAPI Expert will be revealed. 🤫\r\n\r\nOn this talk, you'll understand how you can help the community, and receive guidelines\r\nto be become an expert yourself. 🔥", "description": "FastAPI is a relatively new web framework that has been growing a lot lately. We'll go through the features, and things that make the framework great, and understand why its popularity has been growing so fast.\r\n\r\nWe'll go through the history of the framework, and understand why it was created.\r\nWhat was missing in the world that made FastAPI not only a new web framework, but the missing piece in the Python World.\r\n\r\nFurthermore, we'll see how I went from a newbie to a FastAPI expert, and how you can become one as well.\r\nNo matter how much experience you are, this talk will still be useful to you if you're interested in helping our community.\r\n\r\nProgram:\r\n- Self-introduction (1 min)\r\n- Overview of the session (1 min)\r\n- Motivation (1 min)\r\n- Introduction to FastAPI and features (5 min)\r\n- Explain why FastAPI was created (3 min)\r\n- Share my history with the framework (6 min)\r\n   - How I find out about FastAPI (3 min)\r\n   - My first issues and my first PR (1 min)\r\n   - First job offer to work with FastAPI (1 min)\r\n   - The creation of the discord server, and my daily routine (1 min)\r\n- Share how I went deeper into the ecosystem (5 min)\r\n   - First contributions to Uvicorn (1 min)\r\n   - Receive the invite to become a member of encode (1 min)\r\n   - The first steps on Starlette (1 min)\r\n   - Assume a bit more of responsibility naturally (2 min)\r\n- Summary (2 min)\r\n\r\nVideo: https://youtu.be/ULhX7761GAY", "recording_license": "", "do_not_record": false, "persons": [{"id": 367, "code": "RRPZWA", "public_name": "Marcelo Trylesinski", "biography": "I'm a maintainer of Starlette and Uvicorn. Also a FastAPI Expert! 🚀", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 355, "guid": "8c8a7930-429f-51b9-8b9c-ab1f1839cc62", "logo": "", "date": "2022-09-24T11:55:00+01:00", "start": "11:55", "duration": "00:35", "room": "Auditorium", "slug": "pyconpt2022-355-building-a-handwritten-text-detection-api-for-medical-charts", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/DY77WF/", "title": "Building a Handwritten Text Detection API for Medical Charts", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Medical Charts contain information which is documented in traditional Handwritten format which cannot be processed by NLP. Let's dig into how to build an API which detect handwritten information using FastAPI.", "description": "Talk Description: \r\n\r\n                                            Introduction\r\nWe will discuss on the importance of detecting handwritten text in medical charts with some examples. \r\n               \r\n                                                Basics\r\nWe will mainly discuss about Object detection frameworks and go brief on Faster RCNN framework, how we implemented it using Detectron. We will then deploy the model through FastAPI.\r\n\r\n                                             Methodology\r\nWe will go over through whole Data Cycle of Model. It includes curating, annotating and training the dataset and modelling it and then packaging it into an API.\r\n\r\nIn the end we will talk about the results and takeaway from the project.", "recording_license": "", "do_not_record": false, "persons": [{"id": 385, "code": "VUWTRC", "public_name": "Prashant Nigam", "biography": "Prashant is a data scientist, skilled in application of machine learning techniques for solving data based problems. Currently, a Data Scientist working on Computer Vision Applications.\r\n\r\nHe is an active community guy and loves to share and learn as much he can by organizing Meetup and networking with individuals.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 330, "guid": "589eb0f4-c527-508d-9729-920ca199cd45", "logo": "", "date": "2022-09-24T14:05:00+01:00", "start": "14:05", "duration": "00:30", "room": "Auditorium", "slug": "pyconpt2022-330-automating-mundane-activities-using-python", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/RTA7MU/", "title": "Automating mundane activities using Python", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Do you like sending 200 emails, checking for appointments on a website every 15 minutes or copying a lot of files? No? Thought so! That’s why in this talk you will learn how to automate all of these tasks and more using the magical powers of Python.", "description": "Do you like sending 200 emails, checking for appointments on a website every 15 minutes or copying a lot of files? No? Thought so! That’s why in this talk you will learn how to automate all of these tasks and more using the magical powers of Python.\r\n\r\nAny automation task can be broadly categorised into three stages - task specification, repetition and notification. We will walk through each of these stages with examples of pragmatic use-cases. On the way we will also discuss suitable Python tools to tackle the respective problems — from interacting with user-interfaces using Selenium, to creating cron jobs for scheduling tasks and finally sending notifications via bots to messaging apps.\r\n\r\nThis will give you all the tools you need to delegate repetitive work to machines, so that you can focus on achieving the Zen you always wanted in your life.\r\n\r\nVideo: https://youtu.be/S_5dl3RvdCQ", "recording_license": "", "do_not_record": false, "persons": [{"id": 352, "code": "Y8TWTJ", "public_name": "Ashmi Banerjee", "biography": "Ashmi is a full-time Data Scientist at Deutsche Telekom, Germany and a self-taught (hobby) web developer. She has a master’s degree, with a focus on Machine Learning and Artificial Intelligence,  in Computer Science (Informatics) from Technical University of Munich, Germany.\r\nShe gets excited about new technical challenges and automating mundane activities using technology.\r\n\r\nAs a Google Women Techmakers (WTM) Ambassador and a diversity enthusiast, she is passionate about bridging the gender gap in STEM through a myriad of voluntary activities with different women in STEM networks like Female Tech Leaders, Women Who Code (WWC) and Women in CS at TUM, Anita Borg's Indian Women in Computing (IWiC) etc.\r\n\r\nWhen not sitting in front of her computer, she is either travelling or training to be a triathlete.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 360, "guid": "278809ef-56bc-5dbb-bbca-39a7eeaaf46d", "logo": "", "date": "2022-09-24T14:45:00+01:00", "start": "14:45", "duration": "00:30", "room": "Auditorium", "slug": "pyconpt2022-360-connecting-those-thoughts-personal-knowledge-management-with-python", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/ZYPFGA/", "title": "Connecting those thoughts: Personal knowledge management with Python", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Apps such as Obsidian.md have revolutionised note-taking for the digital age, through connected markdown files. I discuss how I developed a Python package that enabled me to become more effective at learning at university and built a knowledge graph of 500+ notes.", "description": "Software has emerged in the last few years, such as Roam Research and Obsidian.md, for writing notes in a highly-connected format. These apps can display notes in an extensive knowledge graph and have enabled a new wave of personal knowledge management (PKM) for the digital age. This talk provides an introduction to personal knowledge management and shows how I used Python to improve my learning through my Obsidiantools package.\r\n\r\nDuring my MPhil programme in Health Data Science at the University of Cambridge in 2021-22, I wrote all my notes as markdown files through Obsidian.md. I developed the Obsidiantools package for analysing Obsidian.md vaults, in order to improve my Obsidian workflows and analyse my notes via the Python data science stack, NLP packages and NetworkX. Within 3 months, I had written over 65k words in 250+ notes and used network analysis through the Python data stack to improve my strategy for studying.\r\n\r\nConnected notes even go back hundreds of years in an analogue format, through the use of index cards and Zettelkasten systems. In a more modern form, digital note vaults are at the intersection of NLP and network analysis, so there are data science challenges to tackle in those domains (Roam Research even offers a $150k prize for one of those challenges, in case you are tempted).\r\n\r\nTalk structure:\r\n- Introduction to personal knowledge management (PKM)\r\n- My MPhil notes as connected notes\r\n- The Obsidiantools package\r\n- Data science challenges and wrap-up", "recording_license": "", "do_not_record": false, "persons": [{"id": 387, "code": "V7ZAZQ", "public_name": "Mark Farragher", "biography": "Mark is a data scientist who has worked in tech companies and consultancies, in areas such as SaaS, healthcare and ecommerce.  He has developed two popular Python packages, including obsidiantools recently.  He has studied MPhil Population Health Sciences at Cambridge and specialised in Health Data Science.  Over the course of his programme he wrote all his notes in a digital vault via Obsidian.md software.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 322, "guid": "8a346991-e397-51f9-9fbe-624b13c21ea4", "logo": "", "date": "2022-09-24T15:45:00+01:00", "start": "15:45", "duration": "00:35", "room": "Auditorium", "slug": "pyconpt2022-322-text-to-vectors-how-feature-engineering-works-in-natural-language-processing", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/BC97YZ/", "title": "Text to … vectors? How feature engineering works in natural language processing", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Have you ever looked at a text and wondered how on earth it could be used in a machine learning model? How do we get models to understand what we’re reading? In this talk, we’ll examine different ways we can extract meaning from text for use in modelling.", "description": "Do you have an interest in starting your own natural language processing project, but feel overwhelmed by all the talk of attention-based models and text embeddings? Would you like to understand how you can transform a set of texts into features for a model? In this talk, I'll give you a practical demonstration of how meaningful features are created from text data, going from the simplest approaches and working up to cutting edge techniques such as BERT. I’ll demonstrate how to do this using some of the most popular Python packages for NLP, including scikit-learn, nltk and gensim. At each step, we'll discuss why each technique works, what meaning it extracts from the text and what it leaves behind, and the advantages and disadvantages of using each.\r\n\r\nVideo: https://youtu.be/nxLY0GGw5U0", "recording_license": "", "do_not_record": false, "persons": [{"id": 363, "code": "7CWRQB", "public_name": "Jodie Burchell", "biography": "Dr. Jodie Burchell is the Developer Advocate in Data Science at JetBrains, and was previously the Lead Data Scientist in audiences generation at Verve Group Europe. After finishing a PhD in Psychology and a postdoc in biostatistics, she has worked in a range of data science and machine learning roles across search improvement, recommendation systems, NLP and programmatic advertising. She has a particular interest in topics such as applying behavioural science techniques to ML projects and the relationship between engineering and data science. She is also the author of two books, \"The Hitchhiker's Guide to Ggplot2\" and \"The Hitchhiker's Guide to Plotnine\", and writes a data science blog.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 362, "guid": "5adf9bef-4920-5e74-abdf-3e3c9e10db68", "logo": "", "date": "2022-09-24T16:20:00+01:00", "start": "16:20", "duration": "00:35", "room": "Auditorium", "slug": "pyconpt2022-362-use-my-n-point-checklist-to-become-exponentially-happier-with-your-python-project", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/VSHP3V/", "title": "Use my n-point checklist to become exponentially happier with your Python project", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "This year, I took over two open-source Python projects that hadn’t been maintained for years. They used deprecated frameworks and old Python versions. Despite the projects being heavily io-driven and calling web-based APIs, they used synchronous methods. A refactor had been started, then never finished. There were branches full of uncommitted code, tests that tested nothing, irrelevant dependencies… you name it!\r\n\r\nAfter making progress with getting the code into shape, I distilled what I learned into clear steps. When you leave this talk, you will know exactly what to do when you want to improve the performance, security and development ease of Python projects you maintain.\r\n\r\nWe’ll talk about how to fix all of the above and more, including: moving to async programming, adding type validation with Pydantic, overhauling tests, updating without anything exploding, and choosing the right dependencies.\r\n\r\nFinally, I’ll give you a take-home checklist for updating an older project so doing this at home can be efficient and pain-free.", "description": "Video: https://youtu.be/CWQLryJ037g", "recording_license": "", "do_not_record": false, "persons": [{"id": 389, "code": "SV7XBB", "public_name": "Max Kahan", "biography": "I'm a Python Developer Advocate and Software Engineer at Vonage (ex-IBM). I'm interested in APIs, developer relations, machine learning, cloud, developer experience and dancing! My training is in Physics, and now I use my problem-solving skills daily when working on open-source projects and finding ways to make developers’ lives better.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 361, "guid": "98def043-6c52-5238-9337-d3062f4c1e36", "logo": "", "date": "2022-09-24T16:55:00+01:00", "start": "16:55", "duration": "00:30", "room": "Auditorium", "slug": "pyconpt2022-361-why-hello-world-is-a-massive-operation-from-python-code-to-stack-virtual-machine", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/CQURNZ/", "title": "Why \"Hello World\" is a Massive Operation - From Python code to Stack Virtual Machine", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "What happens on the computer when you run print(“Hello world”)? This talk attempts to dissect how Python code gets translated for execution. While many programmers can live without interacting with compiler internals, a stronger understanding of CPython can help make us better programmers.", "description": "Python is a widely-used programming language thanks to its simple code syntax, but this convenience is brought by the hard work of the compiler. Among the many implementations (like PyPy and JPython), we will look at the most widely used CPython implementation. The talk will look at the compilation steps, and examine how the resulting bytecode will be executed in the Python virtual machine. Before a simple string is displayed on a terminal, CPython processes code performs complicated tasks from lexical analysis, parsing, compilation, and to evaluation loop. Even executing a simple program like print(“Hello world”) requires this laborious process performed instantly on the computer. By understanding the execution pipeline, we can identify execution bottlenecks to improve code performance.", "recording_license": "", "do_not_record": false, "persons": [{"id": 388, "code": "JAWPRK", "public_name": "Richard Rowland", "biography": "At from Keio U., I devised a semi-permanent method for storing data using blockchain and P2P networks. I worked on blockchain systems at Softbank and OKCoin Japan, a cryptocurrency exchange. Hobbies include photography, film and opera.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 406, "guid": "c5812358-8e05-50d3-b249-757dc59612de", "logo": "", "date": "2022-09-24T17:30:00+01:00", "start": "17:30", "duration": "00:45", "room": "Auditorium", "slug": "pyconpt2022-406-lightning-talks", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/RJZQQY/", "title": "Lightning Talks", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Lightning Talks", "description": "Video: https://youtu.be/-CAGHKyqg4U", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}, {"id": 408, "guid": "7d642789-dcdd-5e66-8671-03e4cc7743f8", "logo": "", "date": "2022-09-24T18:15:00+01:00", "start": "18:15", "duration": "00:15", "room": "Auditorium", "slug": "pyconpt2022-408-closing-session", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/NLHXPL/", "title": "Closing Session", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Closing Session", "description": "Video: https://youtu.be/aeHVHW0YjAA", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}, {"id": 409, "guid": "a60992de-e7d3-5db7-b77b-570aec8e95c3", "logo": "", "date": "2022-09-24T18:30:00+01:00", "start": "18:30", "duration": "01:30", "room": "Auditorium", "slug": "pyconpt2022-409--sunset-party-sponsored-by-issuu", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/AZ9GSQ/", "title": "** Sunset Party ** sponsored by Issuu", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Sunset Party sponsored by Issuu", "description": "", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}], "Workshops": [{"id": 377, "guid": "e3201290-10e2-5689-806d-e6a6a1ff40b8", "logo": "", "date": "2022-09-24T10:45:00+01:00", "start": "10:45", "duration": "00:50", "room": "Workshops", "slug": "pyconpt2022-377-introduction-to-data-analysis-using-pandas", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/TUZZMY/", "title": "Introduction to Data Analysis Using Pandas", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Working with data can be challenging: it often doesn’t come in the best format for analysis, and understanding it well enough to extract insights requires both time and the skills to filter, aggregate, reshape, and visualize it. This session will equip you with the knowledge you need to effectively use the pandas library to make this process easier.", "description": "This tutorial is for anyone with basic knowledge of Python and an interest in learning how to analyze data in Python. We will be working with Jupyter Notebooks, so attendees should familiarize themselves with the interface (i.e., know how to run/edit a cell) beforehand.\r\n\r\n#### Section 1: Getting Started With Pandas\r\nWe will begin by introducing the `Series`, `DataFrame`, and `Index` classes, which are the basic building blocks of the pandas library, and showing how to work with them. By the end of this section, you will be able to create DataFrames and perform operations on them to inspect and filter the data.\r\n\r\n#### Section 2: Data Wrangling\r\nTo prepare our data for analysis, we need to perform data wrangling. In this section, we will learn how to clean and reformat data (e.g. renaming columns, fixing data type mismatches), restructure/reshape it, and enrich it (e.g. discretizing columns, calculating aggregations, combining data sources).\r\n\r\nWe will take breaks for exercises throughout and all solutions, slides, and notebooks will be provided.\r\n\r\n#### Environment Setup\r\nFollow the setup instructions [here](https://github.com/stefmolin/pandas-workshop#setup-instructions) to get your environment up and running before the session.", "recording_license": "", "do_not_record": false, "persons": [{"id": 402, "code": "9NHRV8", "public_name": "Stefanie Molin", "biography": "Stefanie Molin is a software engineer and data scientist at Bloomberg in New York City, where she tackles tough problems in information security, particularly those revolving around data wrangling/visualization, building tools for gathering data, and knowledge sharing. She is also the author of \"Hands-On Data Analysis with Pandas,\" which is currently in its second edition. She holds a bachelor’s of science degree in operations research from Columbia University's Fu Foundation School of Engineering and Applied Science. She is currently pursuing a master’s degree in computer science, with a specialization in machine learning, from Georgia Tech. In her free time, she enjoys traveling the world, inventing new recipes, and learning new languages spoken among both people and computers.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 352, "guid": "32401128-af49-5b73-9c23-896a9f525941", "logo": "", "date": "2022-09-24T11:40:00+01:00", "start": "11:40", "duration": "00:50", "room": "Workshops", "slug": "pyconpt2022-352-training-deploying-and-running-a-ml-model-using-python-and-snowpark", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/CG3EXY/", "title": "Training, Deploying, and Running a ML model using Python and Snowpark", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "In this session, we will train a ML model to predict future ROI of variable advertising spend budgets across multiple channels including search, video, social media, and email using Snowpark for Python and scikit-learn.", "description": "In this session, we will train a Linear Regression model to predict future ROI (Return On Investment) of variable advertising spend budgets across multiple channels including search, video, social media, and email using Snowpark for Python and scikit-learn. By the end of the session, you will have an interactive web application deployed visualizing the ROI of different allocated advertising spend budgets. \r\n\r\nDuring this hands-on session, we will:\r\n\r\n- Set up your favorite IDE (e.g. Jupyter, VSCode) for Snowpark and ML\r\n- Analyze data and perform data engineering tasks using Snowpark DataFrames \r\n- Use open-source Python libraries from a curated Anaconda channel with near-zero maintenance or overhead\r\n- Deploy ML model training code to Snowflake using Python Stored Procedures\r\n- Create and register Python User-Defined Functions (UDFs) for inference\r\n- Create Streamlit web application that uses the UDF for real-time prediction", "recording_license": "", "do_not_record": false, "persons": [{"id": 370, "code": "VGVQPK", "public_name": "Dash", "biography": "With experience in big data, data science, and machine learning Dash is able to apply 18+ years of full-stack, hands-on software engineering skills to help build solutions that solve business problems and surface trends that shape markets in new ways than imagined before. As a developer advocate, he is passionate about evaluating new ideas, trends, and helping articulate how technology can address a given business problem.\r\n\r\nDash has worked for global enterprises and in agile environments–for tech startups in the Bay Area in varying verticals, such as VoIP, Online Gaming, Digital Health, NoSQL database, and Data Cloud platforms.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 354, "guid": "ed777f19-f648-5dae-9ee4-99d34fb86e4c", "logo": "", "date": "2022-09-24T14:05:00+01:00", "start": "14:05", "duration": "00:50", "room": "Workshops", "slug": "pyconpt2022-354-bulletproof-python-property-based-testing-with-hypothesis", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/JJGSCK/", "title": "Bulletproof Python – Property-Based Testing with Hypothesis", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Property-based testing is a great benefit to the robustness and maintainability of your software. Yet, the technique is still vastly underused in the Python community. The workshop gives a hands-on introduction to Hypothesis and practices different approaches for writing property-based tests.", "description": "Do you find yourself working through pages of copied and pasted tests to accommodate a simple code change? Does your software frequently break in unexpected ways despite your testing efforts? Don’t despair! Property-based testing could be your way out of that mess. Rather than working harder and writing more test code, property-based testing forces you to work smarter and test more code with fewer tests.\r\n\r\nTraditional tests are example-based. They require the developer to come up with arbitrary inputs and check a system’s behavior against explicit outputs. More often than not, developers only think of inputs that are handled correctly by their code, thus leaving bugs hidden. Property-based tests generate the inputs for you and in many cases they’re more likely to find invalid inputs than humans. The difficulty lies in formulating these test cases.\r\n\r\nAfter this workshop you’ll be comfortable with property-based testing using Hypothesis. You’ll have experience requesting appropriate test data from Hypothesis and in writing tests for common and more advanced properties. At work, your co-workers will be impressed by your unbreakable code ;)\r\n\r\nParticipants are expected to have basic familiarity with unit testing and a testing framework. Provided code examples use pytest.", "recording_license": "", "do_not_record": false, "persons": [{"id": 286, "code": "NCQJCQ", "public_name": "Michael Seifert", "biography": "Michael is a consulting software engineer who helps product teams to develop Python software in the cloud. He worked with many different teams from various industries, but none of them practised property-based testing and only few were familiar with the concept.\r\n\r\nThis prompted him to spread the word about property-based testing and Hypothesis in an effort to help others write more robust and maintainable software.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 335, "guid": "bef958f7-6fec-580c-ae3a-d22191afbfa4", "logo": "", "date": "2022-09-24T15:45:00+01:00", "start": "15:45", "duration": "00:50", "room": "Workshops", "slug": "pyconpt2022-335-building-and-optimizing-a-multiclass-text-classifier-using-keras", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/YDHJTF/", "title": "Building and Optimizing a Multiclass Text Classifier using Keras", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Natural Language Processing (NLP) is one of the most exciting fields in Machine Learning and AI. In this beginner-friendly workshop, I will introduce Keras as a Python library for applying NLP techniques on a multi-label emotion classification dataset and present how to use it to build a deep learning classifier. Besides, I will also compare and demonstrate how applying NLP techniques improve the predictability of a model and then, tune a neural network using Keras Tuner to boost the overall model performance.", "description": "Natural Language Processing (NLP) is one of the most exciting fields in Machine Learning and AI. In this beginner-friendly workshop, I will introduce Keras as a Python library for applying NLP techniques on a multi-label emotion classification dataset and present how to use it to build a deep learning classifier. Besides, I will also compare and demonstrate how applying NLP techniques improve the predictability of a model and then, tune a neural network using Keras Tuner to boost the overall model performance. The complete agenda is as outlined below:\r\n1. Introduction to Tokenization\r\n- Keras tokenizer\r\n- Padding and Truncating\r\n2. Introduction to Neural Network and brief overviews of\r\n- Fully Connected Layer\r\n- Embedding Layer\r\n- Dropout Layer\r\n- Long Short Term Memory (LSTM)\r\n3. Model Training\r\n- Early Stopping\r\n- Checkpoints and Callbacks\r\n- Model Compilation\r\n4. Model Evaluation\r\n- Training and Validation Loss\r\n- Reading a Multi-class Classification Report\r\n- Confusion Matrix\r\n5. Model Improvement\r\n- Cleaning and Normalizing Text Data\r\n- Model Compiling Strategy\r\n- Data Usage Strategy\r\n- Optimizing ANN hyperparameters using Keras Tuner\r\n\r\nThis workshop focuses more on using Keras for NLP, multi-class model evaluation, and model optimization using Keras Tuner than on building ANNs from scratch, however, the basic building blocks will be revised during the session.\r\n\r\nResources Available at: https://github.com/royn5618/Talks_Resources/tree/main/PyConPortugal2022", "recording_license": "", "do_not_record": false, "persons": [{"id": 338, "code": "GSVUET", "public_name": "Nabanita Roy", "biography": "Data Scientist @ ACI Worldwide | Education Co-Lead @ Women in AI Ireland | Blogger @ Medium | ❤ NLP", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 340, "guid": "1529ea3c-3195-5d42-9586-19f4e44f3455", "logo": "", "date": "2022-09-24T16:40:00+01:00", "start": "16:40", "duration": "00:50", "room": "Workshops", "slug": "pyconpt2022-340-picking-what-to-watch-next-build-a-recommendation-system", "url": "https://pretalx.evolutio.pt/pyconpt2022/talk/SYBHXG/", "title": "Picking What to Watch Next - build a recommendation system", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Recommendation algorithms are the driving force of many businesses: e-commerce, personalized advertisement, on-demand entertainment. Computer algorithms know what you like and present you with things that are customized for you. Here we will explore how to do that by building a system ourselves.", "description": "In this workshop, we will use MovieLens Datasets to build a very basic recommendation engine. The model will be KNN Item-Based, meaning based on show information, it suggests users who have watched X show a Y show which is similar to that one. While doing it, we will do data transformation with Pandas and Scipy, and train the model with Scikit-learn.\r\n\r\n**For whom is your Workshop**\r\nData Scientist or developers who have no experience in building a recommendation engine and is curious how it can be done. The model we built is in no way good enough to be deployed as a product but would be a very good first model to learn from and get the idea of how machine learning can be used in finding correlations between items.\r\n\r\n**Short Format of your Workshop**\r\nOverview-5 min, Lecture - 20 mins, Hands-on training - 30 mins, Closing - 5 mins\r\n\r\n**Workshop Agenda**\r\nOverview-5 min\r\n\r\nIn this session, we will go through the workshop structure, introduce the steps that we take and the tools that we will be using in the workshop.\r\n\r\nLecture - 20 mins\r\n\r\nIn this session, through slides and presentation, we will go through some knowledge about recommendation engines, what models are available in the market and how they work. We will discuss their advantages and disadvantages and the fundamental theories that work behind the scenes. This will include the model that we are going to build and the more complicated ones that are more commonly used in business.\r\n\r\nHands-on training - 30 mins\r\n\r\nAt the start of this session, we will have a look at the project skeleton and look at the functions that we will implement in this workshop. (5 mins)\r\n\r\nThen we will work on the part that transforms the data into a format that is ready to be trained with the KNN model. (10mins)\r\n\r\nAfterwards, we will work on the part that train the KNN model. Here we will run some experiments and play with different parameters, for example, different similarity metrics, in training. (10 mins)\r\n\r\nFinally, we will test our recommender in the CLI. (5mins)\r\n\r\nBonus: we will test our recommender in the browser with PyScript\r\n\r\nClosing - 5 mins\r\n\r\nIn this session, we will wrap up what we learned and suggest further learning materials to those who may want to study further in this topic.\r\n\r\n**What is required from attendees**\r\nA computer with a stable internet connection; Python 3.9 or above and poetry installed; An opened mind and ready to learn something new\r\n\r\n**What Attendees will Learn**\r\nBy the end of the workshop, you will have been built your first recommendation engine. You will be given enough information about how to build a better one and where to study further in you are inspired to be an expert in this field.\r\n\r\n**Course Benefits**\r\nYou will have learned a new skill set that may assist you in your next data science project. You will be inspired to study further to be able to build a better recommendation engine or do your own research on related topics.", "recording_license": "", "do_not_record": false, "persons": [{"id": 339, "code": "GTVKWZ", "public_name": "Cheuk Ting Ho", "biography": "Before working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Advocate for Anaconda.\r\n\r\nBesides her work, Cheuk enjoys speaking at various conferences. Cheuk also organises events for developers. Cheuk has organised conferences including EuroPython (of which she is a board member), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.", "answers": []}], "links": [], "attachments": [], "answers": []}]}}]}}}